Repository: 84000/data-translation-memory
Catalog: toh556-v3.tmx
Source language: bo
Languages: en

source: འཕགས་པ་གསེར་འོད་དམ་པ་མདོ་སྡེའི་དབང་པོའི་རྒྱལ་པོ་ཞེས་བྱ་བ་ཐེག་པ་ཆེན་པོའི་མདོ། །
en: The Noble Mahāyāna Sūtra The Lord King of Sūtras, The Sublime Golden Light

source: འདས་པ་དང་། མ་བྱོན་པ་དང་། ད་ལྟར་བྱུང་བའི་སངས་རྒྱས་དང་། བྱང་ཆུབ་སེམས་དཔའ་དང་། རང་སངས་རྒྱས་དང་། འཕགས་པ་ཉན་ཐོས་ཐམས་ཅད་ལ་ཕྱག་འཚལ་ལོ། །
en: I pay homage to all the buddhas, bodhisattvas, pratyekabuddhas, and noble śrāvakas of the past, future, and present.

source: འདི་སྐད་བདག་གིས་ཐོས་པ་དུས་གཅིག་ན།
en: Thus did I hear at one time.

source: བཅོམ་ལྡན་འདས་རྒྱལ་པོའི་ཁབ་བྱ་རྒོད་ཕུང་པོའི་རིའི་ཟོམ་ཤིན་ཏུ་རྣམ་པར་དག་པ་ཆོས་ཀྱི་དབྱིངས་ཟབ་མོ། དེ་བཞིན་གཤེགས་པ་རྣམས་ཀྱི་སྤྱོད་ཡུལ་དམ་པ་ན། དགེ་སློང་གི་དགེ་འདུན་ཆེན་པོ་དགེ་སློང་དགུ་ཁྲི་བརྒྱད་སྟོང་དང་ཐབས་ཅིག་ཏུ་བཞུགས་པ་ཐམས་ཅད་ཀྱང་དགྲ་བཅོམ་པ་ཆེན་པོ།
en: The Bhagavat was within the profound, completely pure Dharma realm that is the sublime field of activity of the tathāgatas, dwelling at Vulture Peak Mountain at Rājagṛha, together with a saṅgha of ninety-eight thousand great bhikṣus.

source: གླང་པོ་ཆེའི་རྒྱལ་པོ་ལྟར་ཤིན་ཏུ་དུལ་བ། ཟག་པ་ཟད་པ། ཉོན་མོངས་པ་མེད་པ། སེམས་ཤིན་ཏུ་རྣམ་པར་གྲོལ་བ། ཤེས་རབ་ཤིན་ཏུ་རྣམ་པར་གྲོལ་བ། བྱ་བ་བྱས་པ། ཁུར་བོར་བ། བདག་གི་དོན་རྗེས་སུ་ཐོབ་པ། སྲིད་པར་སྦྱོར་བ་ཡོངས་སུ་བཅད་པ།
en: All of them were great arhats, perfectly tamed like the king of elephants.

source: དབང་ཕྱུག་དམ་པའི་མཆོག་ཐོབ་པ། ཚུལ་ཁྲིམས་རྣམ་པར་དག་པ་ལ་རབ་ཏུ་གནས་པ། ཐབས་དང་ཤེས་རབ་ཀྱིས་ཡོངས་སུ་བཀོད་པ། རྣམ་པར་གྲོལ་བ་བརྒྱད་མངོན་དུ་གྱུར་ཅིང་། ཕ་རོལ་གྱི་མཐར་ཕྱིན་པར་གྱུར་པ་ཤ་སྟག་ལ་འདི་ལྟ་སྟེ། ཚེ་དང་ལྡན་པ་ཀུན་ཤེས་ཀཽཎྜི་ནྱ་དང་། ཚེ་དང་ལྡན་པ་རྟ་ཐུལ་དང་། ཚེ་དང་ལྡན་པ་རླངས་པ་དང་།
en: Their defilements had ceased, they were devoid of kleśas, their minds were completely liberated, their wisdom was completely liberated, they had done what had to be done, they had put down their burdens, they had attained their goals, they had cut through engagement with existence, they had attained supreme and sublime power, they had perfectly maintained pure conduct, they were arrayed with methods and wisdom, they had manifested the eight liberations, and they had reached the farther shore.

source: ཚེ་དང་ལྡན་པ་མིང་ཆེན་དང་། ཚེ་དང་ལྡན་པ་བཟང་པོ་དང་། ཚེ་དང་ལྡན་པ་འོད་སྲུང་ཆེན་པོ་དང་། ཚེ་དང་ལྡན་པ་ལྟེང་རྒྱས་འོད་སྲུང་དང་། ཚེ་དང་ལྡན་པ་ག་ཡཱ་འོད་སྲུང་དང་། ཚེ་དང་ལྡན་པ་ཆུ་བོ་འོད་སྲུང་དང་། ཚེ་དང་ལྡན་པ་ཤཱ་རིའི་བུ་དང་། ཚེ་དང་ལྡན་པ་མཽད་གལ་གྱི་བུ་ཆེན་པོ་དང་།
en: Their names were Venerable Kauṇḍinya, Venerable Aśvajit, Venerable Vāṣpa, Venerable Mahānāman, Venerable Bhadrika, Venerable Mahākāśyapa, Venerable Uruvilva­kāśyapa, Venerable Gayākāśyapa, Venerable Nadīkāśyapa, Venerable Śāriputra, Venerable Mahāmaudgalyāyana, and Ānanda.

source: དགའ་བོ་དང་འདི་དག་ལ་སོགས་པ་ཉན་ཐོས་ཆེན་པོ་རྣམས་ཕྱི་དྲོའི་དུས་ཀྱི་ཚེ། སོ་སོ་ནས་ནང་དུ་ཡང་དག་པར་འཇོག་པ་ལས་ལངས་ཏེ། བཅོམ་ལྡན་འདས་ག་ལ་བ་དེར་དོང་ནས། བཅོམ་ལྡན་འདས་ཀྱི་ཞབས་ལ་སྤྱི་བོས་ཕྱག་འཚལ་ཏེ། ལན་གསུམ་བསྐོར་བ་བྱས་ནས་ཕྱོགས་གཅིག་ཏུ་འཁོད་དོ། །
en: These and the other great śrāvakas had each risen in the afternoon from resting inwardly and had come into the presence of the Bhagavat, bowed down their heads to the feet of the Bhagavat, circumambulated him three times, and sat to one side.

source: གཞན་ཡང་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་བྱེ་བ་བརྒྱ་སྟོང་དང་ཡང་ཐབས་ཅིག་པ་དེ་དག་ཀྱང་།
en: A trillion bodhisattva mahāsattvas were also gathered there.

source: ཀླུའི་རྒྱལ་པོ་ཆེན་པོ་ལྟར་དཔལ་དང་གཟི་བརྗིད་ཆེན་པོར་ལྡན་པས་ཀུན་དུ་གྲགས་པ། སྦྱིན་པ་དང་། ཚུལ་ཁྲིམས་རྣམ་པར་དག་པ། རྟག་ཏུ་སྲུང་བར་མོས་པ་དང་། བཟོད་པ་དང་། བརྩོན་འགྲུས་བསྐལ་པ་གྲངས་མེད་པར་སྤྱོད་པ་བསམ་གཏན་ཀུན་ལས་འདས་པའི་དྲན་པ་མངོན་དུ་གྱུར་པ། ཤེས་རབ་ཀྱི་སྒོ་རྣམ་པར་ཕྱེ་བ་ཐབས་མཁས་པ་ཤིན་ཏུ་བསྒྲུབས་པ། དབང་དམ་པས་རྣམ་པར་རོལ་ཅིང་མངོན་པར་ཤེས་པ་དམ་པ་བརྙེས་པ། གཟུངས་ཆེན་པོ་ཐོབ་པ། སྤོབས་པ་མི་ཟད་པ། ཉོན་མོངས་པ་དང་། ཀུན་ནས་ཉོན་མོངས་པ་ཐམས་ཅད་སྤངས་པས།
en: They were renowned because of being endowed with great brilliance and glory like the great kings of the nāgas.

source: མྱུར་དུ་རྣམ་པ་ཐམས་ཅད་མཁྱེན་པའི་ཡེ་ཤེས་ཐོབ་ཅིང་བདུད་དང་ཕྱིར་རྒོལ་བའི་དཔུང་འཇོམས་པ་ཆོས་ཀྱི་རྔ་ཆེན་པོ་རྡུང་བས་མུ་སྟེགས་ཅན་ཐམས་ཅད་འདུལ་ཞིང་སེམས་རྣམ་པར་དང་བ་སྐྱེད་པར་བྱེད་པ། དམ་པའི་ཆོས་ཀྱི་འཁོར་ལོ་བསྐོར་ནས་ལྷ་དང་མི་རྣམས་སྒྲོལ་བར་བྱེད་པ། ཕྱོགས་བཅུའི་སངས་རྒྱས་ཀྱི་ཞིང་ཐམས་ཅད་བརྒྱན་པར་བྱེད་པ། འགྲོ་བ་དྲུག་ན་གནས་པ་རྣམས་ལ་ཕན་དམ་པ་འདོགས་པ། ཡེ་ཤེས་ཆེན་པོ་ཕུན་སུམ་ཚོགས་པ། བཟོད་པ་ཆེན་པོ་དང་ལྡན་པ། བྱམས་པ་དང་ལྡན་པ། སྙིང་རྗེ་ཆེན་པོའི་སེམས་ལ་གནས་པ། མཐུ་ཆེན་པོ་བརྟན་པ་དང་ལྡན་པ། སངས་རྒྱས་ཐམས་ཅད་ལ་བསྙེན་བཀུར་བྱས་པ། ཡོངས་སུ་མྱ་ངན་ལས་མི་འདའ་ཞིང་མ་འོངས་པའི་མཐའ་ཀླས་པས་གནས་པར་ཡི་དམ་ཆེན་པོ་འཆའ་བ། སངས་རྒྱས་མང་པོ་ལ་རྒྱུ་རྣམ་པར་དག་པ་བསྐྱེད་པ། དུས་གསུམ་གྱི་ཆོས་མི་སྐྱེ་བར་བཟོད་པ་ཐོབ་པ། ཉན་ཐོས་དང་། རང་སངས་རྒྱས་ཀྱི་སྤྱོད་ཡུལ་ལས་ཤིན་ཏུ་འདས་པ། ཐབས་མཁས་པ་ཆེན་པོས་འཇིག་རྟེན་འདྲེན་པ་སྟོན་པ་ཆེན་པོས་བསྟན་པའི་ཆོས་ཟབ་མོའི་དགོངས་པ་འགྲེལ་པ་ལ་མཁས་པ། སྟོང་པ་ཉིད་མངོན་དུ་གྱུར་པས་ཐེ་ཙོམ་ཡོངས་སུ་ཆད་པར་གྱུར་པ་ལ་འདི་ལྟ་སྟེ། བྱང་ཆུབ་སེམས་དཔའ་ཐོགས་པ་མེད་པར་ཆོས་ཀྱི་འཁོར་ལོ་བསྐོར་བ་དང་། བྱང་ཆུབ་སེམས་དཔའ་རྟག་པར་ཆོས་ཀྱི་འཁོར་ལོ་བསྐོར་བར་སེམས་བསྐྱེད་པ་དང་། བྱང་ཆུབ་སེམས་དཔའ་རྟག་ཏུ་བརྩོན་པ་དང་། བྱང་ཆུབ་སེམས་དཔའ་མི་གཏོང་བརྩོན་པ་དང་། བྱང་ཆུབ་སེམས་དཔའ་བྱམས་པ་དང་། བྱང་ཆུབ་སེམས་དཔའ་འཇམ་དཔལ་དང་། བྱང་ཆུབ་སེམས་དཔའ་ཀུན་ཏུ་སྤྱན་རས་གཟིགས་དབང་ཕྱུག་དང་། བྱང་ཆུབ་སེམས་དཔའ་གཟུངས་ཀྱི་དབང་ཕྱུག་རྒྱལ་པོ་དང་། བྱང་ཆུབ་སེམས་དཔའ་སྤོབས་པ་ཆེན་པོས་བཀོད་པའི་རྒྱལ་པོ་དང་། བྱང་ཆུབ་སེམས་དཔའ་ལྷུན་པོའི་རྒྱལ་པོ་དང་། བྱང་ཆུབ་སེམས་དཔའ་རྒྱ་མཚོ་ཟབ་མོའི་རྒྱལ་པོ་དང་། བྱང་ཆུབ་སེམས་དཔའ་རིན་པོ་ཆེའི་ཏོག་དང་། བྱང་ཆུབ་སེམས་དཔའ་རིན་པོ་ཆེའི་ཏོག་ཆེན་པོ་དང་། བྱང་ཆུབ་སེམས་དཔའ་སའི་སྙིང་པོ་དང་། བྱང་ཆུབ་སེམས་དཔའ་ནམ་མཁའི་སྙིང་པོ་དང་། བྱང་ཆུབ་སེམས་དཔའ་ལག་ན་རིན་ཆེན་དབང་ཕྱུག་དང་། བྱང་ཆུབ་སེམས་དཔའ་ལག་ན་རྡོ་རྗེ་དང་། བྱང་ཆུབ་སེམས་དཔའ་དགའ་བའི་སྟོབས་དང་། བྱང་ཆུབ་སེམས་དཔའ་ཆོས་ཆེན་མཐུ་དང་། བྱང་ཆུབ་སེམས་དཔའ་ཤིན་ཏུ་འོད་བཀོད་དང་། བྱང་ཆུབ་སེམས་དཔའ་གསེར་འོད་ཆེན་པོས་བཀོད་པ་དང་། བྱང་ཆུབ་སེམས་དཔའ་ཚུལ་ཁྲིམས་རྣམ་དག་དང་། བྱང་ཆུབ་སེམས་དཔའ་རྟག་ཏུ་ཏིང་ངེ་འཛིན་དང་། བྱང་ཆུབ་སེམས་དཔའ་ཤིན་ཏུ་རྣམ་དག་བློ་གྲོས་དང་། བྱང་ཆུབ་སེམས་དཔའ་བརྩོན་འགྲུས་བརྟན་དང་། བྱང་ཆུབ་སེམས་དཔའ་སེམས་ནམ་མཁའ་བཞིན་དང་། བྱང་ཆུབ་སེམས་དཔའ་སྨོན་ལམ་ཆེན་པོ་མི་གཏོང་བ་དང་། བྱང་ཆུབ་སེམས་དཔའ་སྨན་སྦྱིན་དང་། བྱང་ཆུབ་སེམས་དཔའ་ཉོན་མོངས་ནད་སེལ་དང་། བྱང་ཆུབ་སེམས་དཔའ་སྨན་པའི་རྒྱལ་པོ་དང་། བྱང་ཆུབ་སེམས་དཔའ་དགའ་བས་མཐོ་བའི་རྒྱལ་པོ་དང་། བྱང་ཆུབ་སེམས་དཔའ་ལུང་བསྟན་མཆོག་ཐོབ་དང་། བྱང་ཆུབ་སེམས་དཔའ་སྤྲིན་ཆེན་རྣམ་དག་འོད་དང་། བྱང་ཆུབ་སེམས་དཔའ་སྤྲིན་ཆེན་ཆོས་འཛིན་དང་། བྱང་ཆུབ་སེམས་དཔའ་སྤྲིན་ཆེན་གྲགས་དགའ་དང་། བྱང་ཆུབ་སེམས་དཔའ་སྤྲིན་ཆེན་གྲགས་པ་མཐའ་མེད་སྟོན་དང་། བྱང་ཆུབ་སེམས་དཔའ་སྤྲིན་ཆེན་སེང་གེའི་སྒྲ་དང་། བྱང་ཆུབ་སེམས་དཔའ་སྤྲིན་ཆེན་ཁྱུ་མཆོག་སྒྲ་དང་། བྱང་ཆུབ་སེམས་དཔའ་སྤྲིན་ཆེན་བཀྲ་ཤིས་དང་།
en: They aspired to always maintain generosity and pure conduct; they had practiced patience and diligence for countless eons; they manifested the mindfulness that transcends all dhyānas; they had opened the door to wisdom; they had accomplished skill in methods; they enjoyed sublime sensory powers and had acquired clairvoyance; they had attained the great power of mental retention; they had unceasing eloquence; they had eliminated all kleśas and afflictions; they had quickly attained omniscient wisdom and defeated Māra and the hosts of adversaries; through beating the drum of the Dharma they subdued all tīrthikas and caused them to develop clear minds; through turning the wheel of the Dharma they liberated devas and humans; they adorned all the buddha realms in the ten directions; they brought benefit to those who dwelled in the six existences; they had consummate great wisdom; they were endowed with great patience; they were endowed with love; they maintained the motivation of great compassion; they had enduring great might; they served all the buddhas; they did not pass into nirvāṇa, but instead maintained the great commitment to remain until the future’s end; they had developed pure causes in the presence of many buddhas; they had attained patience toward the quality of birthlessness of the phenomena of the three times; they had completely transcended the field of activity of the śrāvakas and pratyekabuddhas; with great skill in methods they were skilled in explaining the implied meaning of the profound Dharma taught by the great teachers, the guides of the world; and they had cut through all doubts through the direct perception of emptiness.

source: བྱང་ཆུབ་སེམས་དཔའ་སྤྲིན་ཆེན་རིན་ཆེན་དཔལ་དང་། བྱང་ཆུབ་སེམས་དཔའ་སྤྲིན་ཆེན་ཉི་མའི་སྙིང་པོ་དང་། བྱང་ཆུབ་སེམས་དཔའ་སྤྲིན་ཆེན་ཟླ་བའི་སྙིང་པོ་དང་། བྱང་ཆུབ་སེམས་དཔའ་སྤྲིན་ཆེན་སྐར་མའི་འོད་དང་། བྱང་ཆུབ་སེམས་དཔའ་སྤྲིན་ཆེན་མེའི་འོད་དང་། བྱང་ཆུབ་སེམས་དཔའ་སྤྲིན་ཆེན་གློག་གི་འོད་དང་། བྱང་ཆུབ་སེམས་དཔའ་སྤྲིན་ཆེན་འབྲུག་སྒྲ་དང་། བྱང་ཆུབ་སེམས་དཔའ་སྤྲིན་ཆེན་ཤེས་རབ་ཀུན་དུ་འཆར་དང་། བྱང་ཆུབ་སེམས་དཔའ་སྤྲིན་ཆེན་རྣམ་དག་ཆར་པའི་རྒྱལ་པོ་དང་། བྱང་ཆུབ་སེམས་དཔའ་སྤྲིན་ཆེན་མེ་ཏོག་ཤིང་རྒྱལ་དང་། བྱང་ཆུབ་སེམས་དཔའ་སྤྲིན་ཆེན་ཨུཏྤ་ལའི་དྲི་དང་། བྱང་ཆུབ་སེམས་དཔའ་སྤྲིན་ཆེན་རིན་པོ་ཆེ་ཙནྡན་དྲི་བསིལ་སྐུ་དང་། བྱང་ཆུབ་སེམས་དཔའ་སྤྲིན་ཆེན་མུན་སེལ་དང་། བྱང་ཆུབ་སེམས་དཔའ་སྤྲིན་ཆེན་རབ་རིབ་སེལ་བ་ལ་སོགས་པ། བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཚད་མེད་གྲངས་མེད་པ་རྣམས་སོ་སོ་ནས་ཕྱི་དྲོའི་དུས་ཀྱི་ཚེ།
en: Among them were the bodhisattva Anāvaraṇa­dharma­cakra­varta, the bodhisattva Aspiring to Always Turn the Dharma Wheel, the bodhisattva Nityodyukta, the bodhisattva Anikṣiptadhura, the bodhisattva Maitreya, the bodhisattva Mañjuśrī, the bodhisattva Avalokiteśvara, the bodhisattva Dharaṇeśvararāja, the bodhisattva King Fearless Powerful Array, the bodhisattva King of Supreme Mount Meru, the bodhisattva Great Ocean Profound King, the bodhisattva Ratnaketu, the bodhisattva Mahāratnaketu, the bodhisattva Kṣitigarbha, the bodhisattva Ākāśagarbha, the bodhisattva Lord with Jeweled Hands, the bodhisattva Vajrapāṇi, the bodhisattva Ratibala, the bodhisattva Great Dharma Power, the bodhisattva Extremely Radiant Array, the bodhisattva Great Golden Radiant Array, the bodhisattva Pure Ethics, the bodhisattva Always Concentrated, the bodhisattva Extremely Pure Intelligence, the bodhisattva Firm Effort, the bodhisattva Ākāśavat, the bodhisattva Anikṣipta­mahā­praṇidhāna, the bodhisattva Bhaiṣajyadatta, the bodhisattva Curing Affliction, the bodhisattva Bhaiṣajyarāja, the bodhisattva Joyful High King, the bodhisattva Prophesied Attainment, the bodhisattva Great Cloud Completely Pure Radiance, the bodhisattva Great Cloud Dharma Holder, the bodhisattva Great Cloud Renowned Joy, the bodhisattva Great Cloud Renowned Limitless Revealer, the bodhisattva Great Cloud Lion’s Roar, the bodhisattva Great Cloud Supreme Bull’s Sound, the bodhisattva Great Cloud Good Fortune, the bodhisattva Great Cloud Precious Glory, the bodhisattva Great Cloud Sun’s Essence, the bodhisattva Great Cloud Moon’s Essence, the bodhisattva Great Cloud Starlight, the bodhisattva Great Cloud Firelight, the bodhisattva Great Cloud Lightning, the bodhisattva Great Cloud Thunder, the bodhisattva Great Cloud Constant Wisdom Rain, the bodhisattva Great Cloud King Completely Pure Rain, the bodhisattva Great Cloud Flower Tree King, the bodhisattva Great Cloud Utpala Scent, the bodhisattva Precious Cloud Sandalwood Cool Body, the bodhisattva Great Cloud Clearing Darkness, the bodhisattva Great Cloud Clearing Obscured Vision, and so on—countless, numberless bodhisattva mahāsattvas, who, during that afternoon, had arisen from resting internally and come into the presence of the Bhagavat.

source: ནང་དུ་ཡང་དག་པར་འཇོག་པ་ལས་ལངས་ཏེ། བཅོམ་ལྡན་འདས་ག་ལ་བ་དེར་སོང་ནས། བཅོམ་ལྡན་འདས་ཀྱི་ཞབས་གཉིས་ལ་སྤྱི་བོས་ཕྱག་འཚལ་ཏེ། ལན་གསུམ་བསྐོར་བ་བྱས་ནས་ཕྱོགས་གཅིག་ཏུ་འཁོད་དོ། །
en: They bowed down their heads to the feet of the Bhagavat, circumambulated him three times, keeping him to their right, and sat to one side.

source: དེ་ནས་ཡང་ལིཙྪ་བཱི་གཞོན་ནུ་རྣམས་ལ་འདི་ལྟ་སྟེ། གཞོན་ནུ་སེང་གེའི་འོད་དང་། གཞོན་ནུ་སེང་གེའི་བློ་གྲོས་དང་། གཞོན་ནུ་ཆོས་སྦྱིན་དང་། གཞོན་ནུ་དབང་པོ་སྦྱིན་དང་། གཞོན་ནུ་འོད་ཆེན་དང་། གཞོན་ནུ་དཔལ་ཆེན་དང་། གཞོན་ནུ་སངས་རྒྱས་སྐྱོང་དང་། གཞོན་ནུ་ཆོས་སྐྱོང་དང་། གཞོན་ནུ་དགེ་འདུན་སྐྱོང་དང་།
en: There were also 580,000 Licchavī youths.

source: གཞོན་ནུ་རྡོ་རྗེ་སྐྱོང་དང་། གཞོན་ནུ་ནམ་མཁའ་སྐྱོང་དང་། གཞོན་ནུ་ནམ་མཁའ་སྒྲོགས་དང་། རིན་ཆེན་སྙིང་པོ་གཞོན་ནུ་དང་། བཀྲ་ཤིས་མཆོག་གི་སྙིང་པོ་གཞོན་ནུ་ལ་སོགས་པ་ལྔ་འབུམ་བརྒྱད་སྟོང་དེ་དག་ཀྱང་།
en: Among them were Kumāra Lion’s Light, Kumāra Siṃhamati, Kumāra Dharmadatta, Kumāra Powerful Bestower, Kumāra Mahāprabha, Kumāra Great Glory, Kumāra Buddhapālita, Kumāra Dharmapāla, Kumāra Sustaining the Saṅgha, Kumāra Vajra Guard, Kumāra Ākāśapāla, Kumāra Ākāśaghoṣa, Kumāra Ratnagarbha, Kumāra Supreme Auspicious Essence, and so on.

source: བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ལ་བདེ་བར་གནས་པ། ཐེག་པ་ཆེན་པོ་ལ་རབ་ཏུ་མོས་པ་དེ་དག་སོ་སོ་ནས་ཕྱི་དྲོའི་དུས་ཀྱི་ཚེ།
en: They were pleasantly established in the highest, most complete enlightenment and had perfect aspiration for the Mahāyāna.

source: བཅོམ་ལྡན་འདས་ག་ལ་བ་དེར་ལྷགས་ནས། བཅོམ་ལྡན་འདས་ཀྱི་ཞབས་ལ་སྤྱི་བོས་ཕྱག་འཚལ་ཏེ། ལན་གསུམ་བསྐོར་བ་བྱས་ནས། ཕྱོགས་གཅིག་ཏུ་འདུག་གོ། །
en: During that afternoon they had come into the presence of the Bhagavat, bowed down their heads to the feet of the Bhagavat, circumambulated him three times, keeping him to their right, and sat to one side.

source: གཞན་ཡང་ལྷའི་སྲས་པོ་ལ་འདི་ལྟ་སྟེ།
en: There were also 42,000 devas.

source: ལྷའི་སྲས་པོ་དགའ་བ་མཐོང་བ་དང་། ལྷའི་སྲས་པོ་རབ་དགའ་དང་། ལྷའི་སྲས་པོ་ཉི་འོད་དང་། ལྷའི་སྲས་པོ་ཟླ་བའི་གཙུག་ཕུད་དང་། ལྷའི་སྲས་པོ་ཤེས་རབ་གསལ་དང་། ལྷའི་སྲས་པོ་ནམ་མཁའ་རྣམ་དག་ཤེས་རབ་དང་། ལྷའི་སྲས་པོ་ཉོན་མོངས་ནད་སེལ་དང་། ལྷའི་སྲས་པོ་བཀྲ་ཤིས་དང་། དེ་དག་ལ་སོགས་པ་ལྷའི་སྲས་པོ་བཞི་ཁྲི་ཉིས་སྟོང་ཡང་།
en: Among them were Deva Beautiful to See, Deva Pramudita, Deva Sūryaprabha, Deva Moon Crest, Deva Clear Insight, Deva Ākāśa­viśuddha­prajña, Deva Remover of Affliction, Deva Maṅgala, and so on.

source: ཐེག་པ་ཆེན་པོ་སྲུང་བ་དང་། ཡང་དག་པའི་ཆོས་རྗེས་སུ་འཛིན་ཅིང་། རྒྱུན་མི་འཆད་པར་བྱ་བར་སྨོན་ལམ་རྒྱ་ཆེན་པོ་བཏབ་པ་དེ་དག་ཐམས་ཅད་ཀྱང་ཕྱི་དྲོའི་དུས་ཀྱི་ཚེ།
en: They had made the vast prayer to guard the Mahāyāna Dharma, to hold the true Dharma, and to prevent its discontinuation.

source: བཅོམ་ལྡན་འདས་ག་ལ་བ་དེར་ལྷགས་ནས། བཅོམ་ལྡན་འདས་ཀྱི་ཞབས་ལ་སྤྱི་བོས་ཕྱག་འཚལ་ཏེ། ལན་གསུམ་བསྐོར་བ་བྱས་ནས། ཕྱོགས་གཅིག་ཏུ་འཁོད་དོ། །
en: During that afternoon they had come into the presence of the Bhagavat, bowed down their heads to the feet of the Bhagavat, circumambulated him three times, keeping him to their right, and then sat to one side.

source: གཞན་ཡང་ཀླུའི་རྒྱལ་པོ་ལ་འདི་ལྟ་སྟེ། ཀླུའི་རྒྱལ་པོ་པདྨོ་དང་། ཀླུའི་རྒྱལ་པོ་ཨེ་ལའི་འདབ་མ་དང་། ཀླུའི་རྒྱལ་པོ་སྟོབས་ཆེན་དང་།
en: There were also 28,000 nāga kings.

source: ཀླུའི་རྒྱལ་པོ་སྒྲ་ཆེན་དང་། ཀླུའི་རྒྱལ་པོ་དབའ་རླབས་ཆུང་དང་། ཀླུའི་རྒྱལ་པོ་ཀླུང་འཛིན་དང་། ཀླུའི་རྒྱལ་པོ་གསེར་གདོང་དང་། ཀླུའི་རྒྱལ་པོ་གཟི་ཅན་ལ་སོགས་པ། ཀླུའི་རྒྱལ་པོ་ཉི་ཁྲི་བརྒྱད་སྟོང་པོ་དེ་དག་ཀྱང་ཐེག་པ་ཆེན་པོའི་ཆོས་འཆང་ཞིང་འཛིན་པར་མོས་པ་དང་།
en: Among them were Nāga King Padma, Nāga King Elapatra, Nāga King Mahābala, Nāga King Mahāghoṣa, Nāga King Alpormika, Nāga King River Holder, Nāga King Golden Face, Nāga King Manasvī, and so on.

source: ཡོངས་སུ་རྒྱས་པ་དང་། བསྲུང་བར་སེམས་བསྐྱེད་པ་ཤ་སྟག་སྟེ།
en: They had all aspired to possess and hold the Mahāyāna and had developed the motivation to spread and protect it.

source: དེ་དག་ཐམས་ཅད་ཀྱང་སོ་སོ་ནས་ཕྱི་དྲོའི་དུས་ཀྱི་ཚེ། བཅོམ་ལྡན་འདས་ག་ལ་བ་དེར་ལྷགས་ནས། བཅོམ་ལྡན་འདས་ཀྱི་ཞབས་ལ་སྤྱི་བོས་ཕྱག་འཚལ་ཏེ། ལན་གསུམ་བསྐོར་བ་བྱས་ནས། ཕྱོགས་གཅིག་ཏུ་འཁོད་དོ། །
en: During that afternoon, each of them had come into the presence of the Bhagavat, bowed down their heads to the feet of the Bhagavat, circumambulated him three times, keeping him to their right, and sat to one side.

source: གཞན་ཡང་གནོད་སྦྱིན་གྱི་རྒྱལ་པོ་རྣམ་ཐོས་ཀྱི་བུ་ལ་སོགས་པ་སུམ་ཁྲི་དྲུག་སྟོང་ལ་འདི་ལྟ་སྟེ། གནོད་སྦྱིན་ཨ་མྲ་དང་།
en: There was also the yakṣa king Vaiśravaṇa with 36,000 yakṣas.

source: གནོད་སྦྱིན་ཨ་མྲ་འཆང་དང་། གནོད་སྦྱིན་པདྨོའི་འོད་ཀྱི་སྙིང་པོ་དང་། གནོད་སྦྱིན་པདྨོའི་གདོང་དང་། གནོད་སྦྱིན་ཁྲོ་གཉེར་ཅན་དང་། གནོད་སྦྱིན་འཇིགས་པ་ཆེན་པོ་སྟོན་དང་།
en: Among them were Yakṣa Amra, Yakṣa Amradhara, Yakṣa Essence of Lotus Radiance, Yakṣa Lotus Face, Yakṣa Bhṛkuṭi, Yakṣa Manifesting Great Fear, Yakṣa Bhūmikampa, Yakṣa Annaharaṇa, and so on.

source: གནོད་སྦྱིན་ས་གཡོ་བྱེད་དང་། གནོད་སྦྱིན་ཟས་འཕྲོག་ལ་སོགས་པའི་གནོད་སྦྱིན་དེ་དག་ཀྱང་། དེ་བཞིན་གཤེགས་པའི་ཆོས་ཡང་དག་པ་ལ་དད་ཅིང་བསྲུང་བ་ལ་བརྩོན་པ་ཤ་སྟག་སྟེ།
en: All those yakṣas had faith in the Dharma of the Tathāgata and were dedicated to guarding it.

source: དེ་དག་ཐམས་ཅད་ཀྱང་ཕྱི་དྲོའི་དུས་ཀྱི་ཚེ། བཅོམ་ལྡན་འདས་ག་ལ་བ་དེར་ལྷགས་ནས། བཅོམ་ལྡན་འདས་ཀྱི་ཞབས་ལ་སྤྱི་བོས་ཕྱག་འཚལ་ཏེ། ལན་གསུམ་བསྐོར་བ་བྱས་ནས། ཕྱོགས་གཅིག་ཏུ་འཁོད་དོ། །
en: During that afternoon, all of them came into the presence of the Bhagavat, bowed down their heads to the feet of the Bhagavat, circumambulated him three times, keeping him to their right, and sat to one side.

source: གཞན་ཡང་ནམ་མཁའ་ལྡིང་གི་རྒྱལ་པོ་སྤོས་ཀྱི་གླང་པོ་ཆེ་མཐུ་སྟོབས་རྒྱལ་པོ་ལ་སོགས་པ་བཞི་ཁྲི་དགུ་སྟོང་དང་། གཞན་ཡང་དྲི་ཟ་དང་། ལྷ་མ་ཡིན་དང་། མི་འམ་ཅི་དང་། ལྟོ་འཕྱེ་ཆེན་པོ་ལ་སོགས་པ་དང་།
en: There were also 49,000 garuḍas, such as the garuḍa king Powerful King of Elephants.

source: རི་དང་། ནགས་ཚལ་དང་། ཆུ་བོ་དང་། རྒྱ་མཚོའི་ལྷའི་དྲང་སྲོང་རྣམས་དང་། རྒྱལ་པོ་ཆེན་པོ་དང་། དེའི་འཁོར་དང་། བཙུན་མོ་དང་། སྲས་དང་། རིགས་ཀྱི་བུ་དང་། རིགས་ཀྱི་བུ་མོ་དང་། ལྷ་དང་།
en: There were also gandharvas, asuras, kinnaras, kumbhāṇḍas, and mahoragas; divine ṛṣis of mountains, forests, rivers, and seas; great kings and their retinues, queens, attendants, sons, noblemen, and noblewomen; and devas, humans, and so on.

source: མི་ལ་སོགས་པ་དེ་དག་ཐམས་ཅད་བླ་ན་མེད་པའི་ཐེག་པ་ཆེན་པོ་འདི་ཀློག་ཅིང་འདོན་པ་དང་། འཆང་ཞིང་འཛིན་པ་དང་། འདྲི་བ་དང་། རྒྱས་པར་བྱེད་པ་དང་། སྲུང་ཞིང་སྐྱོབ་པར་སྨོན་ལམ་ཡོངས་སུ་འདེབས་པ་དེ་དག་ཐམས་ཅད་ཀྱང་ཕྱི་དྲོའི་དུས་ཀྱི་ཚེ།
en: They had all prayed to read, recite, possess and hold, question, spread, guard, and protect this unsurpassable Mahāyāna Dharma.

source: བཅོམ་ལྡན་འདས་ག་ལ་བ་དེར་ལྷགས་ཏེ། བཅོམ་ལྡན་འདས་ཀྱི་ཞབས་ལ་སྤྱི་བོས་ཕྱག་འཚལ་ནས། ལན་གསུམ་བསྐོར་བ་བྱས་ཏེ། ཕྱོགས་གཅིག་ཏུ་འཁོད་དོ། །དེ་ལྟར་ཉན་ཐོས་དང་།
en: During that afternoon all of them had come into the presence of the Bhagavat, bowed down their heads to the feet of the Bhagavat, circumambulated him three times, keeping him to their right, and sat to one side.

source: བྱང་ཆུབ་སེམས་དཔའ་དང་། ལྷ་དང་། མི་དང་། ལྷ་མ་ཡིན་དང་། ནམ་མཁའ་ལྡིང་ལ་སོགས་པ་སྡེ་བརྒྱད་པོ་དེ་དག་སྤྲིན་བཞིན་དུ་འདུས་པ།
en: In that way, those śrāvakas, bodhisattvas, devas, humans, asuras, garuḍas, and so on—all those eight classes of beings—had gathered like clouds.

source: སེམས་རྩེ་གཅིག་ཏུ་བྱས་ནས་ཐལ་མོ་སྦྱར་ཏེ། མིག་མི་འཛུམས་པས། བཅོམ་ལྡན་འདས་ཀྱི་ཞལ་དུ་བལྟ་ཞིང་། དམ་པའི་ཆོས་བསྟན་པར་མོས་པས་གསོལ་བ་འདེབས་སོ། །
en: With one-pointed minds, with palms together in homage, and with unblinking eyes, they gazed at the Bhagavat’s face, and wishing that he would teach the Dharma, they supplicated him.

source: དེ་ནས་བཅོམ་ལྡན་འདས་ཕྱི་དྲོའི་དུས་ཀྱི་ཚེ། ཏིང་ངེ་འཛིན་ལས་བཞེངས་ཏེ། འཁོར་འདུས་པ་མང་པོ་ལ་གཟིགས་ནས་ཚིགས་སུ་བཅད་པ་འདི་དག་གསུངས་སོ། །མདོ་སྡེའི་རྒྱལ་པོའི་དབང་པོ་སྟེ། །
en: Then, during the afternoon, the Bhagavat arose from samādhi, looked upon the multitude that had assembled, and recited these verses: “I will teach this Sublime Golden Light, Which is the lord of the kings of sūtras.

source: མཉན་ན་ཤིན་ཏུ་ཟབ་པ་དང་། །ཡོངས་སུ་བརྟགས་ན་ཟབ་པ་ཉིད། །གསེར་འོད་དམ་པ་འདི་འཆད་དོ། །
en: “If you listen to it, it is profound; If you analyze it, it is profound.

source: ཕྱོགས་བཞིར་སངས་རྒྱས་རྣམས་ཀྱིས་ནི། །བྱིན་གྱིས་རླབས་ཀྱིས་བྱིན་བརླབས་པ། །མི་འཁྲུགས་པས་ནི་ཤར་ཕྱོགས་སུ། །རིན་ཆེན་རྟོག་གིས་ལྷོ་ཕྱོགས་སུ། །འོད་དཔག་མེད་ཀྱིས་ནུབ་ཕྱོགས་སུ། །
en: “It has received the blessings Of the buddhas in the four directions: “The Buddha Akṣobhya in the east, The Buddha Ratnaketu in the south, The Buddha Amitābha in the west, And the Buddha Dundubhisvara in the north.

source: རྔ་སྒྲ་ཡིས་ནི་བྱང་ཕྱོགས་སུ། །སྡིག་པ་ཐམས་ཅད་གཞིག་པའི་ཕྱིར། །བཤད་པ་དམ་པ་བཀྲ་ཤིས་པ། །
en: “This auspicious, sublime teaching Is in order to eliminate all bad actions.

source: སྡིག་པའི་ལས་རྣམས་ཟད་བྱེད་པ། །
en: It causes all bad karma to cease.

source: བདེ་བ་ཐམས་ཅད་སྦྱིན་བྱེད་པ། །སྡུག་བསྔལ་ཐམས་ཅད་འཇིག་བྱེད་པ། །
en: “It will bestow every happiness; It will eliminate all suffering.

source: ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཀྱི་གཞི། །དཔལ་ཀུན་གྱིས་ནི་ལེགས་པར་བརྒྱན། །བྱིན་གྱིས་བརླབས་ཏེ་བརྗོད་པར་བྱ། །སེམས་ཅན་གང་དག་དབང་པོ་ཉམས། །ཚེ་ཟད་པ་དང་ཚེ་ཉམས་དང་། །ཕུན་སུམ་ཚོགས་མིན་གང་ཆགས་དང་། །ལྷ་རྣམས་རྒྱབ་ཀྱིས་ཕྱོགས་པ་དང་། །མཛའ་སྡུག་སྐྱེ་བོ་སྡང་བ་དང་། །བྲན་གཟའ་ལ་སོགས་གཙེས་པ་དང་། །ཕན་ཚུན་མཐུན་པ་མ་ཡིན་དང་། །ནོར་འགྲིབས་པས་ནི་གནོད་པ་དང་། །
en: It is the basis of omniscience, And it is adorned by every splendor.

source: མྱ་ངན་ངལ་དང་གནོད་པ་དང་། །འཇིགས་པ་དང་ནི་ཕོངས་པ་དང་། །གཟའ་དང་རྒྱུ་སྐར་བྱད་སྟེམས་དང་། །མི་བཟད་གདོན་གྱིས་ཉེན་པ་དང་། །མྱ་ངན་ངལ་ལས་བྱུང་བ་ཡི། །རྨི་ལམ་སྡིག་པ་མཐོང་ན་ཡང་། །དེས་ནི་རབ་བཀྲུས་གཙང་མ་ཡིན། །མདོ་སྡེ་དམ་པ་མཉན་པར་བྱ། །གང་དག་ཡིད་དགེ་སེམས་དང་ཞིང་། །
en: “Beings with impaired faculties, Whose lives are in decline and ending; Those who are beset by misfortune, Who have been forsaken by the devas, “Who are hated by their spouses and other people, Who are tormented by family and servants, Who are in conflict with others, And who are oppressed by loss of wealth; “Those who are miserable, tired, and ruined, Who are frightened and in distress, Who are oppressed by planets and lunar asterisms, And who are afflicted by dreadful demons; “And those who see evil in their dreams Arising from misery and fatigue Should wash themselves clean And listen to this supreme sūtra.

source: གོས་གཙང་རྣམས་ཀྱིས་རབ་བརྒྱན་ཏེ། །ཟབ་མོ་སངས་རྒྱས་སྤྱོད་ཡུལ་བ། །མདོ་འདི་ཉན་པར་བྱེད་ན་ནི། །མདོ་སྡེ་འདི་ཡི་གཟི་བརྗིད་ཀྱིས། །སྲོག་ཆགས་ཀུན་གྱི་གནོད་པ་དག །ཤིན་ཏུ་མི་བཟད་འདི་འདྲ་བ། །དེ་དག་རྟག་ཏུ་ཞི་བར་འགྱུར། །
en: “For those who listen to this sūtra, This profound field of the buddhas, With a lucid mind and good motivation, And dressed in clean clothes— “For all those beings, All those dreadful misfortunes Will always come to an end Through the brilliance of this sūtra.

source: འཇིག་རྟེན་སྐྱོང་བ་བདག་ཉིད་དང་། །བློན་པོ་ཚོགས་ཀྱི་དབང་ཕྱུག་བཅས། །གནོད་སྦྱིན་བྱེ་བ་དུ་མ་ཡིས། །དེ་དག་ལ་ནི་སྲུང་བར་བྱེད། །ལྷ་མོ་ཆེན་མོ་དབྱངས་ཅན་དང་། །ནཻ་རཉྫ་ནར་གནས་པ་དང་། །འབྱུང་པོའི་མ་མོ་འཕྲོག་མ་དང་། །
en: “The guardians of the world themselves And their ministers and army generals, As well as a multitude of millions of yakṣas, Will be their protectors.

source: ས་ཡི་ལྷ་མོ་བརྟན་མ་དང་། །ཚངས་པའི་དབང་དང་ལྷ་དབང་དང་། །ཀླུ་དབང་མཐུ་ཆེན་རྣམས་དང་ནི། །མི་འམ་ཅི་དབང་ལྷ་མིན་དབང་། །དེ་བཞིན་ནམ་མཁའ་ལྡིང་དབང་རྣམས། །སྡེ་དང་སྟོབས་དང་བཞོན་པ་དང་། །བཅས་ཏེ་དེ་དག་དེར་ལྷགས་ནས། །ཉིན་དང་མཚན་མོ་མི་གཡེལ་བར། །
en: “The great goddess Sarasvatī And Nairañjanāvasinī, Hārītī, the mother of spirits, And Dṛḍhā, the goddess of the earth; “The lords of Brahmā devas, lords of the devas; The greatly powerful lords of the nāgas; And the lords of the kinnaras, the lords of the asuras, And similarly the lords of the garuḍas “Will come to the place where those people are, Accompanied by troops and steeds, And will be their protectors, Attentive day and night.

source: དེ་དག་ལ་ནི་སྲུང་བར་བྱེད། །ཟབ་མོ་སངས་རྒྱས་སྤྱོད་ཡུལ་བ། །སངས་རྒྱས་ཀུན་གྱི་གསང་བ་སྟེ། །བསྐལ་པ་བྱེ་བར་རྙེད་དཀའ་བ། །མདོ་འདི་རབ་ཏུ་བཤད་པར་བྱ། །
en: “I will elucidate this sūtra, Which is the profound field of the buddhas, Which is the secret of all buddhas, And which is difficult to obtain in a million eons.

source: གང་དག་མདོ་འདི་ཉན་པ་དང་། །གང་དག་གཞན་ལ་ཐོས་བྱེད་དང་། །གང་དག་རྗེས་སུ་ཡི་རང་དང་། །གང་དག་མཆོད་པ་བྱེད་པ་རྣམས། །དེ་དག་ལྷ་དང་ཀླུ་དག་དང་། །མི་དང་མི་འམ་ཅི་དག་དང་། །ལྷ་མིན་གནོད་སྦྱིན་དུ་མ་ཡིས། །
en: “Those who hear this sūtra And cause others to hear it, And those who rejoice in this sūtra, And those who make offerings to it, “Throughout millions of eons Will themselves receive offerings From devas, nāgas, and humans, And from kinnaras, asuras, and yakṣas.

source: བསྐལ་པ་བྱེ་བར་མཆོད་པར་འགྱུར། །སྲོག་ཆགས་བསོད་ནམས་བྱེད་པ་རྣམས། །དེ་དག་བསོད་ནམས་ཕུང་པོ་ནི། །མཐའ་ཡས་གྲངས་ཀྱང་མེད་པ་དང་། །བསམ་གྱིས་མི་ཁྱབ་སྐྱེ་བར་འགྱུར། །
en: “For beings who create this merit, There will arise for them An infinite, incalculable, Inconceivable mass of merit.

source: ཕྱོགས་བཅུའི་རྫོགས་པའི་སངས་རྒྱས་དང་། །དེ་བཞིན་ཟབ་མོར་སྤྱོད་པ་ཡི། །བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱིས་ཀྱང་། །རབ་ཏུ་གཟུང་བར་འགྱུར་བ་ཡིན། །
en: “They will be taken into the care Of the perfect buddhas in the ten directions, And similarly by the bodhisattvas Who have profound activity.
